<script setup lang="ts"></script>

<template>
  <div>
    <img
      src="/assets/img/bg-gradient-img.png"
      alt="bg gradient"
      class="absolute w-screen h-screen left-0 top-0 object-cover z-0"
    />
    <section class="relative z-10 pt-56 pb-20 text-white h-screen flex flex-col justify-between">
      <h1 class="max-w-[730px] text-7xl">
        <span class="font-black tracking-wide">Будущее начинается здесь:</span><br />
        Институт Компьютерных Наук и Технологий
      </h1>
      <p class="text-2xl max-w-3xl mt-6 font-normal">
        Инновации, передовые технологии, лучшие преподаватели и перспективы для каждого студента
      </p>
      <div class="flex gap-6">
        <Button>О нас</Button>
        <Button>Поступить</Button>
      </div>
    </section>
    <section class="mt-24 text-white">
      <h2 class="text-5xl font-black drop-shadow-[0_0_10px_rgba(31,48,255,0.9)]">Об институте</h2>
      <div class="mt-6 flex justify-between gap-10">
        <div class="w-1/2 flex flex-col gap-6 font-light text-2xl leading-tight">
          <p>
            <span class="font-bold">Институт Компьютерных Наук и Технологий ПГНИУ</span> — это центр
            передовых IT-решений и инноваций. Мы готовим специалистов в области программирования,
            искусственного интеллекта, кибербезопасности и разработки высокотехнологичных систем.
          </p>
          <p>
            Наши студенты получают не только фундаментальные знания, но и практический опыт, работая
            над реальными проектами и стажируясь в ведущих IT-компаниях. Современные лаборатории,
            сильный преподавательский состав и активное сообщество студентов делают обучение
            увлекательным и перспективным.
          </p>
          <p class="font-bold">Будущее технологий создаётся здесь! 🚀</p>
        </div>

        <div class="w-1/2">
          <Badge />
        </div>
      </div>
    </section>
  </div>
</template>

<style scoped></style>
